---
kind: method
id: M:Autodesk.Revit.Creation.Application.NewUV(Autodesk.Revit.DB.UV)
source: html/744b38a8-8ef3-a33b-388d-f958dfa35c5b.htm
---
# Autodesk.Revit.Creation.Application.NewUV Method

Creates a UV object by copying the supplied UV object.

## Syntax (C#)
```csharp
public UV NewUV(
	UV uv
)
```

## Parameters
- **uv** (`Autodesk.Revit.DB.UV`) - The supplied UV object